package ru.job4j.oop;

public class Ball {
    public void reply(Hare hare) {
        System.out.println("Я Колобок, Колобок,\n"
                + "Я по коробу скребен,\n"
                + "По сусеку метен,\n"
                + "На сметане мешон\n"
                + "Да в масле пряжон,\n"
                + "На окошке стужон.\n"
                + "Я от дедушки ушел,\n"
                + "Я от бабушки ушел,\n"
                + "От тебя, зайца, подавно уйду!\n");
    }

    public void reply(Wolf wolf) {
        System.out.println("Я Колобок, Колобок,\n"
                + "Я по коробу скребен,\n"
                + "По сусеку метен,\n"
                + "На сметане мешон\n"
                + "Да в масле пряжон,\n"
                + "На окошке стужон.\n"
                + "Я от дедушки ушел,\n"
                + "Я от бабушки ушел,\n"
                + "От тебя, волк, подавно уйду!\n");
    }

    public void reply(Fox fox) {
        System.out.println("Я Колобок, Колобок,\n"
                + "Я по коробу скребен,\n"
                + "По сусеку метен,\n"
                + "На сметане мешон\n"
                + "Да в масле пряжон,\n"
                + "На окошке стужон.\n"
                + "Я от дедушки ушел,\n"
                + "Я от бабушки ушел,\n"
                + "От тебя, лисы, нехитро уйти!\n");
    }

    public void dies() {
        System.out.println("Колобок прыг Лисе на язык, а Лиса его — гам! — и съела.");
    }
}
